2022/03/about_selfish.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<!-- 2024-03-25 Mon 00:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>聪明的自私与愚蠢的自私</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="panshishuo" />
<link rel="icon" href="/panshi/favicon.ico" type="image/vnd.microsoft.icon"/><link rel="stylesheet" type="text/css" href="/panshi/style.css"/>
</head>
<body>
<div id="preamble" class="status">
<div id="org-div-home-and-up">
 <a accesskey="h" href="/panshi/sitemap.html"> 索引 </a>
 |
 <a accesskey="H" href="/panshi"> 主页 </a>
 |
 <a accesskey="" href="/panshi/pics.html"> 图集 </a>
 |
 <a accesskey="" href="https://github.com/xingangshi" target="_blank"> GITHUB </a>
 |
 <a accesskey="" href="https://www.shixingang.com/diary/" target="_blank"> 随笔 </a>
 |
 <a accesskey="" href="https://www.geekpanshi.com/" target="_blank"> 旧博客 </a>
 |
 <a><input type="text" class="st-default-search-input" placeholder="站内搜索..."/></a>
</div>
<script type="text/javascript">
  (function(w,d,t,u,n,s,e){w['SwiftypeObject']=n;w[n]=w[n]||function(){
  (w[n].q=w[n].q||[]).push(arguments);};s=d.createElement(t);
  e=d.getElementsByTagName(t)[0];s.async=1;s.src=u;e.parentNode.insertBefore(s,e);
  })(window,document,'script','//s.swiftypecdn.com/install/v2/st.js','_st');

  _st('install','-7xxk_zZkMGeYu7EHZqk','2.0.0');
</script>

<script src="https://cdn.bootcss.com/vue/2.6.11/vue.min.js"></script>
</div>
<div id="content">
<h1 class="title">聪明的自私与愚蠢的自私</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1781348">自私的分类</a></li>
<li><a href="#org00b5996">自私排行榜</a></li>
<li><a href="#org1dc7c60">何去何从？</a></li>
</ul>
</div>
</div>
<p>
靠得住的做法，还是把话说透，把账算清。其实，自私未必害人，也可能只是吝啬；损人也未必利己，也可能得不偿失。有“损人利己”，也有“利人利己”。把“利人”和“利己”对立起来，或者把“损人”和“利己”等同起来，恐怕都不科学。
</p>

<div id="outline-container-org1781348" class="outline-2">
<h2 id="org1781348">自私的分类</h2>
<div class="outline-text-2" id="text-org1781348">
<p>
科学的方法，是把所有的选项都列出来，看看究竟有多少可能，多种可能：
</p>

<p>
人、己、利、损，排列组合，至少有以下这些选项 ———
</p>

<p>
　　一，毫不利己，专门利人；
</p>

<p>
　　二，毫不利人，专门利己；
</p>

<p>
　　三，为了利己，不惜损人；
</p>

<p>
　　四，只是利己，并不损人；
</p>

<p>
　　五，既不利人，也不利己；
</p>

<p>
　　六，既不损己，也不损人；
</p>

<p>
　　七，利人利己，人己两利；
</p>

<p>
　　八，害人害己，人己两害；
</p>

<p>
　　九，损了别人，没利自己；
</p>

<p>
　　十，毫不利己，专门害人。
</p>
</div>
</div>


<div id="outline-container-org00b5996" class="outline-2">
<h2 id="org00b5996">自私排行榜</h2>
<div class="outline-text-2" id="text-org00b5996">
<p>
我们可以做一个“排行榜”
</p>

<p>
　　最崇高：大公无私，毫不利己，专门利人。这是只有“圣人”才能做到的。我们可以推崇，可以向往，可以赞美，甚至可以提倡，但不能强求。因此这一选项，不妨作为少数人的追求。
</p>

<p>
　　最君子：一事当前，先利别人，后利自己。不是圣人也能做到，但需要境界。这种境界无关乎学问，也无关乎修养，说白了是一种人生态度，因此往往只有“一念之差”。
</p>

<p>
　　最感人：关键时刻，牺牲自己，帮助别人。不是圣人也能做到，但需要爱心。比如做母亲的，在危难时刻，往往会“本能”地挺身而出，牺牲自己，保护孩子。
</p>

<p>
　　最聪明：利人利己，人己两利，互利双赢。不是圣人也能做到，但需要智慧，也需要信念，即相信人与人是可以和谐相处、互助互爱的。实际上，不损人则仁，能利己则智。互利双赢，可谓“仁智双全”，值得提倡。
</p>

<p>
　　最保险：只是利己，并不损人。
</p>

<p>
　　最本分：既不损己，也不损人。
</p>

<p>
　　最消极：既不利人，也不利己。
</p>

<p>
　　最自私：毫不利人，专门利己。以上四种，不需要智慧，也不需要境界，还不需要信念和爱心，任何人都能做到。格调虽然不高，但于社会无害，应该宽容。
</p>

<p>
　　最卑劣：为了利己，不惜损人。这是社会公害，必须坚决反对。
</p>

<p>
　　最愚蠢：损了别人，没利自己。傻瓜才这么做。
</p>

<p>
　　最混蛋：害人害己，人己两害。可谓丧心病狂。
</p>

<p>
　　最恐怖：毫不利己，专门害人。为什么这个最恐怖？因为有“道德光环”，并不容易识破，却很容易获得同情，我们不能不提高警惕，倍加小心。
</p>
</div>
</div>

<div id="outline-container-org1dc7c60" class="outline-2">
<h2 id="org1dc7c60">何去何从？</h2>
<div class="outline-text-2" id="text-org1dc7c60">
<p>
所有的账，现在都算清楚了。何去何从，诸位三思。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr/>
<script src="https://utteranc.es/client.js"
    repo="geekpanshi/apc"
    issue-term="pathname"
    label="apc"
    theme="github-light"
    crossorigin="anonymous"
    async>
</script>
<hr/>
<p >标题：聪明的自私与愚蠢的自私</p>
<p class="date">日期：2024-03-25 Mon 00:00</p>
<p class="author">作者：<a href="https://nas.qysit.com:2046/geekpanshi/panshi_imgs/-/raw/main/images/about/dx17wGO.png">磐石说</a></p>
<p class="creator">© 2018 – 2023 <a href="https://github.com/geekpanshi">GeekPanshi</a> (<a href="https://www.shixingang.com/">shixingang</a>)</p>
<p class="validation"></p>
</div>
</body>
</html>
